app/views/users/edit.html.erb

SELECT "skills".* FROM "skills" INNER JOIN "users_skills" ON "skills"."id" = "users_skills"."skill_id" WHERE "users_skills"."user_id" = $1 AND "skills"."id" = $2  [["user_id", 11], ["id", 25]]
---
	<% @skills.each do |s| %>
		<%= check_box_tag "user[skill_ids][]", s.id, @user.skills.include?(s) %>