app/views/users/show.html.erb

SELECT "skills".* FROM "skills" INNER JOIN "users_skills" ON "skills"."id" = "users_skills"."skill_id" WHERE "users_skills"."user_id" = $1  [["user_id", 11]]
---
		<span>SKILLS:</span>
		<% @user.skills.each do |s| %>