app/controllers/filters_controller.rb

def new
   @user = current_user

   @industries = Industry.all
    @skills = Skill.all
    @avails = Availability.all
    @locations = Location.all
---
SELECT "industries".* FROM "industries"
SELECT "skills".* FROM "skills"
SELECT "availabilities".* FROM "availabilities"
SELECT "locations".* FROM "locations"

 def index
   binding.pry
  @user = current_user
  @filter_results
  @users = User.all
---
SELECT "users".* FROM "users"

 def update
    # binding.pry
    filter_results(params)
    industry = params["filter"]["industry_id"].to_i
    avail = params["filter"]["availability_id"].to_i
    skills = params["filter"]["skill_id"]
    location = params["filter"]["job_location_id"]

   @filter_results = User.where(availability_id: avail, industry_id: industry, skill_id: skills, job_location_id: location)
---
SELECT  "users".* FROM "users" WHERE "users"."availability_id" = $1 AND "users"."industry_id" = $2 AND "users"."job_location_id" = $3 AND "users"."skill_id" IN (16, 18) LIMIT 1  [["availability_id", 6], ["industry_id", 14], ["job_location_id", 6]]