app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "davidcarlsonberg@gmail.com"]]
---
  def create
    # login the user, then redirect to content
    @user = User.find_by(email: session_params[:email])