app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role_id" IN (2, 3)
---
  def mentees

   @users = User.where(:role_id=> [ 5, 6])

SELECT "users".* FROM "users" WHERE "users"."role_id" IN (1, 3)
---
  def mentors
    @users = User.where(:role_id=> [ 4, 6])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
---
  def show

  @user = User.find(params["id"])

SELECT "industries".* FROM "industries"
SELECT "roles".* FROM "roles"
---
  def new
    @user = User.new
    @industries = Industry.all
    @skills = Skill.all
    @roles = Role.all

INSERT INTO "users" ("name", "email", "password_digest", "mentor_type", "industry_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create

    @user = User.new( user_params )
    @roles = Role.all

    if @user.save

SELECT "industries".* FROM "industries"
SELECT "skills".* FROM "skills"
SELECT "availabilities".* FROM "availabilities"
SELECT "locations".* FROM "locations"
SELECT "roles".* FROM "roles"
---
  def edit
    @industries = Industry.all
    @skills = Skill.all
    @avails = Availability.all
    @locations = Location.all
    @roles = Role.all

SELECT "industries".* FROM "industries"
SELECT "skills".* FROM "skills"
SELECT "availabilities".* FROM "availabilities"
SELECT "locations".* FROM "locations"
SELECT "roles".* FROM "roles"
UPDATE "users" SET "job_location_id" = $1, "availability_id" = $2, "bio" = $3, "title" = $4, "fun_fact" = $5, "interests" = $6, "updated_at" = $7 WHERE "users"."id" = $8  [["job_location_id", 6], ["availability_id", 6], ["bio", "weee"], ["title", ""], ["fun_fact", "erer"], ["interests", "rererr"], ["updated_at", "2015-03-15 19:20:36.560982"], ["id", 4]]
---
  def update

    @industries = Industry.all
    @skills = Skill.all
    @avails = Availability.all
    @locations = Location.all
    @roles = Role.all

    if current_user.id != params[:id].to_i
      redirect_to user_path(current_user)
    else
      @user = current_user
       skills = params["user"]["skill_ids"]
       @user.skill_ids = skills
      @user.update(profile_params)